import { Country } from "@/type"

const kuwaitGovernorate = [
    'الجهراء',
    'الفروانية',
    'حولي',
    'الاحمدي',
    'مبارك الكبير',
    'العاصمة',
]

const alJhra = [
    'الواحة',
    'العيون',
    'القصر',
    'الجهراء القديمة',
    'النسيم',
    'تيماء',
    'النعيم',
    'مدينة سعد العبد الله',
    'كبد',
    'الصليبية'
]

const alFarwaniyah = [
    'أبرق خيطان',
    'الأندلس',
    'اشبيلية',
    'خيطان',
    'الفروانية',
    'الفردوس',
    'صباح الناصر',
    'العمرية',
    'العارضية',
    'الرقعي',
    'الرابية',
    'الرحاب',
    'جليب الشيوخ',
    'الضجيج',
    'الشدادية',
    'عبدالله المبارك'
]

const hawalli = [
    'مبارك العبدالله الجابر',
    'جنوب السرة',
    'السرة',
    'الشهداء',
    'الشعب',
    'الرميثية',
    'حطين',
    'السلام',
    'البدع',
    'البيان',
    'سلوى',
    'الجابرية',
    'السالمية',
    'مشرف',
    'الزهراء',
    'الصديق'
]

const ahmadi = [
    'الظهر',
    'الرقه',
    'هدية',
    'المنقف',
    'أبو حليفة',
    'الفنطاس',
    'العقيلة',
    'الصباحية',
    'الأحمدي',
    'الفحيحيل',
    'الأحمدي',
    'ضاحية علي صباح السالم',
    'الشعيبة',
    'بنيدر',
    'الجليعة',
    'المهبولة',
    'الخيران',
    'الوفرة',
    'ضاحية فهد الأحمد',
    'ضاحية جابر العلي',
    'مدينة صباح الأحمد'
]

const mubarakAlKabeer = [
   'مُبارك الكَبير',
   'صباح السالم',
   'المسيلة',
   'أبو فطيرة',
   'الفنيطيس',
   'القصور',
   'القرين',
   'منطقة صبحان',
   'الفنطاس',
   'العدان'
]

const capital = [
    'مدينة جابر الأحمد',
    'ضاحية عبدالله السالم',
    'الصليبيخات',
    'وشمال غرب الصليبيخات' ,
    'دسمان',
    'الصوابر' ,
    'المرقاب' ,
    'كيفان' ,
    'القادسية' ,
    'الصالحية' ,
    ' بنيد القار' ,
    'المنصورية' ,
    'اليرموك' ,
    'قرطبة',
    'الدسمة',
    'الدعية',
    'الوطية',
    'الشامية',
    'الفيحاء',
    'النزهة',
    'الروضة',
    'العديلية',
    'النهضة',
    'الدوحة',
    'غرناطة',
    'الخالدية',
    'القيروان',
    'السرة'
]

const kuwait:Country = {
    name:'الكويت',
    governoratesNames:kuwaitGovernorate,
    getGovernorateCities:(governorateName)=>{
        switch(governorateName){
            case kuwaitGovernorate[0]:
                return alJhra;
            case kuwaitGovernorate[1]:
                return alFarwaniyah;
            case kuwaitGovernorate[2]:
                return hawalli;
            case kuwaitGovernorate[3]:
                return ahmadi;
            case kuwaitGovernorate[4]:
                return mubarakAlKabeer;
            case kuwaitGovernorate[5]:
                return capital;
            default:
                return [
                    ...alJhra,
                    ...alFarwaniyah,
                    ...hawalli,
                    ...ahmadi,
                    ...mubarakAlKabeer,
                    ...capital
                ]
        }
    }
}
export default kuwait